{"config": {"input_layers": [["mirna", 0, 0], ["target", 0, 0]], "name": "model_1", "layers": [{"name": "mirna", "config": {"name": "mirna", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 30, 4]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "target", "config": {"name": "target", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 60, 4]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1d_1", "config": {"filters": 10, "bias_regularizer": null, "strides": [1], "dtype": "float32", "use_bias": true, "activation": "linear", "name": "conv1d_1", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.009999999776482582, "l2": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "batch_input_shape": [null, 30, 4], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [8], "dilation_rate": [1], "activity_regularizer": null}, "inbound_nodes": [[["mirna", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_2", "config": {"filters": 10, "bias_regularizer": null, "strides": [1], "dtype": "float32", "use_bias": true, "activation": "linear", "name": "conv1d_2", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.009999999776482582, "l2": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "batch_input_shape": [null, 60, 4], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [8], "dilation_rate": [1], "activity_regularizer": null}, "inbound_nodes": [[["target", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling1d_1", "config": {"trainable": true, "pool_size": [4], "strides": [1], "dtype": "float32", "name": "max_pooling1d_1", "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling1D"}, {"name": "max_pooling1d_2", "config": {"trainable": true, "pool_size": [4], "strides": [1], "dtype": "float32", "name": "max_pooling1d_2", "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling1D"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}], ["max_pooling1d_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "batch_normalization_1", "config": {"trainable": true, "epsilon": 0.001, "center": true, "dtype": "float32", "gamma_constraint": null, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "beta_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "dropout_1", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "bidirectional_1", "config": {"merge_mode": "concat", "name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"config": {"go_backwards": false, "recurrent_regularizer": null, "unroll": false, "use_bias": true, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 10, "recurrent_dropout": 0.0, "batch_input_shape": [null, null, 10], "return_sequences": true, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "stateful": false, "implementation": 2, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "unit_forget_bias": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "sigmoid", "activity_regularizer": null}, "class_name": "LSTM"}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Bidirectional"}, {"name": "batch_normalization_2", "config": {"trainable": true, "epsilon": 0.001, "center": true, "dtype": "float32", "gamma_constraint": null, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "beta_regularizer": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "dropout_2", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.5, "name": "dropout_2", "trainable": true, "seed": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_1", "config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "use_bias": true, "activation": "linear", "name": "dense_1", "trainable": true, "units": 100, "kernel_regularizer": {"config": {"l1": 0.009999999776482582, "l2": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_3", "config": {"trainable": true, "epsilon": 0.001, "center": true, "dtype": "float32", "gamma_constraint": null, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "beta_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "dropout_3", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.5, "name": "dropout_3", "trainable": true, "seed": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "use_bias": true, "activation": "linear", "name": "dense_2", "trainable": true, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_4", "config": {"trainable": true, "epsilon": 0.001, "center": true, "dtype": "float32", "gamma_constraint": null, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "beta_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "activation_4", "config": {"activation": "sigmoid", "name": "activation_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["activation_4", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Model"}